#!/bin/bash
#############################################################
#
#功能： 打印输出函数
#
#最后修改时间：2019年9月2日
#
#############################################################
print_r(){
    echo -e "\033[31m $@ \033[0m"
}
print_g(){
    echo -e "\033[32m $@ \033[0m"
}
print_y(){
    echo -e "\033[33m $@ \033[0m"
}

#打印错误信息
print_error(){
    echo -e "\033[31m [错误]: $@ \033[0m"
}
#打印平常信息
print_info(){
    echo -e "\033[32m [信息]: $@ \033[0m"
}

#打印变量
print_var(){
    echo -e "\033[36m $1: $2 \033[0m"
}